docs/measurements/results/room-lock-strategy-comparison/raw/A/room-lock-786-minimal-v1-t1-constant-mixed-c8-p5-a/room-k6-t1-37ff81b803cd/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /opt/albam-mate-load/room-k6/room-lock-786-minimal-v1-t1-constant-mixed-c8-p5-a/room-k6-t1-37ff81b803cd/scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 32 max VUs, 1m30s max duration (incl. graceful stop):
              * room_write: 8.00 iterations/s for 1m0s (maxVUs: 16-32, gracefulStop: 30s)


Run          [ 100% ] setup()
room_write   [   0% ]

Run          [ 100% ] setup()
room_write   [   0% ]

running (0m02.9s), 04/16 VUs, 2 complete and 0 interrupted iterations
room_write   [   1% ] 04/16 VUs  0m00.7s/1m0s  8.00 iters/s

running (0m03.9s), 01/16 VUs, 13 complete and 0 interrupted iterations
room_write   [   3% ] 01/16 VUs  0m01.7s/1m0s  8.00 iters/s

running (0m04.9s), 01/16 VUs, 21 complete and 0 interrupted iterations
room_write   [   4% ] 01/16 VUs  0m02.7s/1m0s  8.00 iters/s

running (0m05.9s), 01/16 VUs, 29 complete and 0 interrupted iterations
room_write   [   6% ] 01/16 VUs  0m03.7s/1m0s  8.00 iters/s

running (0m06.9s), 01/16 VUs, 37 complete and 0 interrupted iterations
room_write   [   8% ] 01/16 VUs  0m04.7s/1m0s  8.00 iters/s

running (0m07.9s), 01/16 VUs, 45 complete and 0 interrupted iterations
room_write   [   9% ] 01/16 VUs  0m05.7s/1m0s  8.00 iters/s

running (0m08.9s), 01/16 VUs, 53 complete and 0 interrupted iterations
room_write   [  11% ] 01/16 VUs  0m06.7s/1m0s  8.00 iters/s

running (0m09.9s), 01/16 VUs, 61 complete and 0 interrupted iterations
room_write   [  13% ] 01/16 VUs  0m07.7s/1m0s  8.00 iters/s

running (0m10.9s), 01/16 VUs, 69 complete and 0 interrupted iterations
room_write   [  14% ] 01/16 VUs  0m08.7s/1m0s  8.00 iters/s

running (0m11.9s), 01/16 VUs, 77 complete and 0 interrupted iterations
room_write   [  16% ] 01/16 VUs  0m09.7s/1m0s  8.00 iters/s

running (0m12.9s), 01/16 VUs, 85 complete and 0 interrupted iterations
room_write   [  18% ] 01/16 VUs  0m10.7s/1m0s  8.00 iters/s

running (0m13.9s), 01/16 VUs, 93 complete and 0 interrupted iterations
room_write   [  19% ] 01/16 VUs  0m11.7s/1m0s  8.00 iters/s

running (0m14.9s), 01/16 VUs, 101 complete and 0 interrupted iterations
room_write   [  21% ] 01/16 VUs  0m12.7s/1m0s  8.00 iters/s

running (0m15.9s), 01/16 VUs, 109 complete and 0 interrupted iterations
room_write   [  23% ] 01/16 VUs  0m13.7s/1m0s  8.00 iters/s

running (0m16.9s), 02/16 VUs, 116 complete and 0 interrupted iterations
room_write   [  24% ] 02/16 VUs  0m14.7s/1m0s  8.00 iters/s

running (0m17.9s), 01/16 VUs, 125 complete and 0 interrupted iterations
room_write   [  26% ] 01/16 VUs  0m15.7s/1m0s  8.00 iters/s

running (0m18.9s), 01/16 VUs, 133 complete and 0 interrupted iterations
room_write   [  28% ] 01/16 VUs  0m16.7s/1m0s  8.00 iters/s

running (0m19.9s), 01/16 VUs, 141 complete and 0 interrupted iterations
room_write   [  29% ] 01/16 VUs  0m17.7s/1m0s  8.00 iters/s

running (0m20.9s), 01/16 VUs, 149 complete and 0 interrupted iterations
room_write   [  31% ] 01/16 VUs  0m18.7s/1m0s  8.00 iters/s

running (0m21.9s), 01/16 VUs, 157 complete and 0 interrupted iterations
room_write   [  33% ] 01/16 VUs  0m19.7s/1m0s  8.00 iters/s

running (0m22.9s), 01/16 VUs, 165 complete and 0 interrupted iterations
room_write   [  34% ] 01/16 VUs  0m20.7s/1m0s  8.00 iters/s

running (0m23.9s), 01/16 VUs, 173 complete and 0 interrupted iterations
room_write   [  36% ] 01/16 VUs  0m21.7s/1m0s  8.00 iters/s

running (0m24.9s), 01/16 VUs, 181 complete and 0 interrupted iterations
room_write   [  38% ] 01/16 VUs  0m22.7s/1m0s  8.00 iters/s

running (0m25.9s), 01/16 VUs, 189 complete and 0 interrupted iterations
room_write   [  39% ] 01/16 VUs  0m23.7s/1m0s  8.00 iters/s

running (0m26.9s), 01/16 VUs, 197 complete and 0 interrupted iterations
room_write   [  41% ] 01/16 VUs  0m24.7s/1m0s  8.00 iters/s

running (0m27.9s), 01/16 VUs, 205 complete and 0 interrupted iterations
room_write   [  43% ] 01/16 VUs  0m25.7s/1m0s  8.00 iters/s

running (0m28.9s), 01/16 VUs, 213 complete and 0 interrupted iterations
room_write   [  44% ] 01/16 VUs  0m26.7s/1m0s  8.00 iters/s

running (0m29.9s), 01/16 VUs, 221 complete and 0 interrupted iterations
room_write   [  46% ] 01/16 VUs  0m27.7s/1m0s  8.00 iters/s

running (0m30.9s), 01/16 VUs, 229 complete and 0 interrupted iterations
room_write   [  48% ] 01/16 VUs  0m28.7s/1m0s  8.00 iters/s

running (0m31.9s), 02/16 VUs, 236 complete and 0 interrupted iterations
room_write   [  49% ] 02/16 VUs  0m29.7s/1m0s  8.00 iters/s

running (0m32.9s), 01/16 VUs, 245 complete and 0 interrupted iterations
room_write   [  51% ] 01/16 VUs  0m30.7s/1m0s  8.00 iters/s

running (0m33.9s), 01/16 VUs, 253 complete and 0 interrupted iterations
room_write   [  53% ] 01/16 VUs  0m31.7s/1m0s  8.00 iters/s

running (0m34.9s), 01/16 VUs, 261 complete and 0 interrupted iterations
room_write   [  54% ] 01/16 VUs  0m32.7s/1m0s  8.00 iters/s

running (0m35.9s), 01/16 VUs, 269 complete and 0 interrupted iterations
room_write   [  56% ] 01/16 VUs  0m33.7s/1m0s  8.00 iters/s

running (0m36.9s), 01/16 VUs, 277 complete and 0 interrupted iterations
room_write   [  58% ] 01/16 VUs  0m34.7s/1m0s  8.00 iters/s

running (0m37.9s), 01/16 VUs, 285 complete and 0 interrupted iterations
room_write   [  59% ] 01/16 VUs  0m35.7s/1m0s  8.00 iters/s

running (0m38.9s), 01/16 VUs, 293 complete and 0 interrupted iterations
room_write   [  61% ] 01/16 VUs  0m36.7s/1m0s  8.00 iters/s

running (0m39.9s), 01/16 VUs, 301 complete and 0 interrupted iterations
room_write   [  63% ] 01/16 VUs  0m37.7s/1m0s  8.00 iters/s

running (0m40.9s), 01/16 VUs, 309 complete and 0 interrupted iterations
room_write   [  64% ] 01/16 VUs  0m38.7s/1m0s  8.00 iters/s

running (0m41.9s), 01/16 VUs, 317 complete and 0 interrupted iterations
room_write   [  66% ] 01/16 VUs  0m39.7s/1m0s  8.00 iters/s

running (0m42.9s), 01/16 VUs, 325 complete and 0 interrupted iterations
room_write   [  68% ] 01/16 VUs  0m40.7s/1m0s  8.00 iters/s

running (0m43.9s), 01/16 VUs, 333 complete and 0 interrupted iterations
room_write   [  69% ] 01/16 VUs  0m41.7s/1m0s  8.00 iters/s

running (0m44.9s), 01/16 VUs, 341 complete and 0 interrupted iterations
room_write   [  71% ] 01/16 VUs  0m42.7s/1m0s  8.00 iters/s

running (0m45.9s), 01/16 VUs, 349 complete and 0 interrupted iterations
room_write   [  73% ] 01/16 VUs  0m43.7s/1m0s  8.00 iters/s

running (0m46.9s), 01/16 VUs, 357 complete and 0 interrupted iterations
room_write   [  74% ] 01/16 VUs  0m44.7s/1m0s  8.00 iters/s

running (0m47.9s), 01/16 VUs, 365 complete and 0 interrupted iterations
room_write   [  76% ] 01/16 VUs  0m45.7s/1m0s  8.00 iters/s

running (0m48.9s), 01/16 VUs, 373 complete and 0 interrupted iterations
room_write   [  78% ] 01/16 VUs  0m46.7s/1m0s  8.00 iters/s

running (0m49.9s), 01/16 VUs, 381 complete and 0 interrupted iterations
room_write   [  79% ] 01/16 VUs  0m47.7s/1m0s  8.00 iters/s

running (0m50.9s), 01/16 VUs, 389 complete and 0 interrupted iterations
room_write   [  81% ] 01/16 VUs  0m48.7s/1m0s  8.00 iters/s

running (0m51.9s), 01/16 VUs, 397 complete and 0 interrupted iterations
room_write   [  83% ] 01/16 VUs  0m49.7s/1m0s  8.00 iters/s

running (0m52.9s), 01/16 VUs, 405 complete and 0 interrupted iterations
room_write   [  84% ] 01/16 VUs  0m50.7s/1m0s  8.00 iters/s

running (0m53.9s), 02/16 VUs, 412 complete and 0 interrupted iterations
room_write   [  86% ] 02/16 VUs  0m51.7s/1m0s  8.00 iters/s

running (0m54.9s), 01/16 VUs, 421 complete and 0 interrupted iterations
room_write   [  88% ] 01/16 VUs  0m52.7s/1m0s  8.00 iters/s

running (0m55.9s), 01/16 VUs, 429 complete and 0 interrupted iterations
room_write   [  89% ] 01/16 VUs  0m53.7s/1m0s  8.00 iters/s

running (0m56.9s), 01/16 VUs, 437 complete and 0 interrupted iterations
room_write   [  91% ] 01/16 VUs  0m54.7s/1m0s  8.00 iters/s

running (0m57.9s), 01/16 VUs, 445 complete and 0 interrupted iterations
room_write   [  93% ] 01/16 VUs  0m55.7s/1m0s  8.00 iters/s

running (0m58.9s), 01/16 VUs, 453 complete and 0 interrupted iterations
room_write   [  94% ] 01/16 VUs  0m56.7s/1m0s  8.00 iters/s

running (0m59.9s), 01/16 VUs, 461 complete and 0 interrupted iterations
room_write   [  96% ] 01/16 VUs  0m57.7s/1m0s  8.00 iters/s

running (1m00.9s), 01/16 VUs, 469 complete and 0 interrupted iterations
room_write   [  98% ] 01/16 VUs  0m58.7s/1m0s  8.00 iters/s

running (1m01.9s), 01/16 VUs, 477 complete and 0 interrupted iterations
room_write   [  99% ] 01/16 VUs  0m59.7s/1m0s  8.00 iters/s


  █ THRESHOLDS 

    room_contract_failures
    ✓ 'count==0' count=0

    room_request_duration{outcome:business}
    ✓ 'p(99)>=0' p(99)=0s

    room_request_duration{outcome:concurrency}
    ✓ 'p(99)>=0' p(99)=584.13ms

    room_request_duration{outcome:success}
    ✓ 'p(99)>=0' p(99)=256.91ms

    room_request_duration{outcome:unexpected}
    ✓ 'p(99)>=0' p(99)=0s

    room_server_failures
    ✓ 'count==0' count=0

    room_start_skew_ms
    ✓ 'max<1000' max=0s

    room_unexpected_4xx
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 480     7.713478/s
    checks_succeeded...: 100.00% 480 out of 480
    checks_failed......: 0.00%   0 out of 480

    ✓ ROOM-LOCK-CMP T1 cancel participation response contract

    CUSTOM
    room_business_failures.........: 0      0/s
    room_concurrent_failures.......: 1      0.01607/s
    room_contract_failures.........: 0      0/s
    room_created...................: 0      0/s
    room_request_duration..........: avg=69.28ms  min=35.41ms  med=59.65ms  max=584.13ms p(90)=90.35ms  p(95)=111.1ms  p(99)=315.8ms  count=480
      { outcome:business }.........: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s       count=0  
      { outcome:concurrency }......: avg=584.13ms min=584.13ms med=584.13ms max=584.13ms p(90)=584.13ms p(95)=584.13ms p(99)=584.13ms count=1  
      { outcome:success }..........: avg=68.2ms   min=35.41ms  med=59.59ms  max=405.91ms p(90)=90.23ms  p(95)=110.74ms p(99)=256.91ms count=479
      { outcome:unexpected }.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s       count=0  
    room_requests..................: 480    7.713478/s
    room_server_failures...........: 0      0/s
    room_start_skew_ms.............: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s       count=480
    room_success...................: 479    7.697409/s
    room_unexpected_4xx............: 0      0/s

    HTTP
    http_req_duration..............: avg=70.36ms  min=4ms      med=59.45ms  max=584.13ms p(90)=93.67ms  p(95)=150.91ms p(99)=369.81ms count=504
      { expected_response:true }...: avg=69.33ms  min=4ms      med=59.44ms  max=406.72ms p(90)=92.73ms  p(95)=148.29ms p(99)=330.79ms count=503
    http_req_failed................: 0.19%  1 out of 504
    http_reqs......................: 504    8.099152/s

    EXECUTION
    iteration_duration.............: avg=69.81ms  min=66.86µs  med=60.54ms  max=590.53ms p(90)=91.8ms   p(95)=115.39ms p(99)=317.5ms  count=481
    iterations.....................: 481    7.729548/s
    vus............................: 1      min=0        max=4 
    vus_max........................: 16     min=16       max=16

    NETWORK
    data_received..................: 369 kB 5.9 kB/s
    data_sent......................: 47 kB  752 B/s



running (1m02.2s), 00/16 VUs, 481 complete and 0 interrupted iterations
room_write ✓ [ 100% ] 00/16 VUs  1m0s  8.00 iters/stime="2026-08-20T09:45:10Z" level=error msg="Error: constant-arrival-rate iteration에 대응하는 fixture target이 없습니다: 480\n\tat targetForConstantArrival (file:///opt/albam-mate-load/room-k6/room-lock-786-minimal-v1-t1-constant-mixed-c8-p5-a/room-k6-t1-37ff81b803cd/scenario.js:60:11(14))\n\tat measurementTarget (file:///opt/albam-mate-load/room-k6/room-lock-786-minimal-v1-t1-constant-mixed-c8-p5-a/room-k6-t1-37ff81b803cd/scenario.js:78:37(63))\n\tat default (file:///opt/albam-mate-load/room-k6/room-lock-786-minimal-v1-t1-constant-mixed-c8-p5-a/room-k6-t1-37ff81b803cd/scenario.js:86:39(4))\n" executor=constant-arrival-rate scenario=room_write source=stacktrace